# LineLoad Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LineLoad Properties
LineLoad Class See Also
---
The LineLoad type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| EndPoint | Returns the three dimensional location of the end point for the line load. |
| ForceVector1 | The force vector applied to the start point of the line load, oriented according to OrientTo setting. |
| ForceVector2 | The force vector applied to the end point of the line load, oriented according to OrientTo setting. |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| HostElementId | The host element ID for the load.  (Inherited from LoadBase.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsConstrainedOnHost | The load is constrained to host or not.  (Inherited from LoadBase.) |
| IsHosted | Indicates if the Load is hosted or non-hosted.  (Inherited from LoadBase.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsProjected | Indicates if the load is projected. |
| IsReaction | The load is reaction option.  (Inherited from LoadBase.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsUniform | Indicates if the load is uniform. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| LoadCase | The load case for the load.  (Inherited from LoadBase.) |
| LoadCaseId | The load case ID for the load.  (Inherited from LoadBase.) |
| LoadCaseName | The name of the load case to which this load belongs.  (Inherited from LoadBase.) |
| LoadCategoryName | The name of the category to which this load belongs.  (Inherited from LoadBase.) |
| LoadNatureName | A string representing the nature of the load.  (Inherited from LoadBase.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| MomentVector1 | The moment vector applied to the start point of the line load, oriented according to OrientTo setting. |
| MomentVector2 | The moment vector applied to the end point of the line load, oriented according to OrientTo setting. |
| Name | A human readable name for the Element. (Inherited from Element.) |
| OrientTo | The load orientation option.  (Inherited from LoadBase.) |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| StartPoint | Returns the three dimensional location of the start point for the line load. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorkPlaneId | Id of the work plane which may determine the orientation of the load.  (Inherited from LoadBase.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace